-- Data for table: approval_holiday
-- Generated on: 2026-01-13

INSERT INTO `approval_holiday` (`id`, `date`, `name`, `type`, `year`, `is_workday`) VALUES
(1, '2023-12-31 16:00:00', '元旦', 'national', 2024, 0),
(2, '2024-02-09 16:00:00', '春节', 'national', 2024, 0),
(3, '2024-02-10 16:00:00', '春节', 'national', 2024, 0),
(4, '2024-02-11 16:00:00', '春节', 'national', 2024, 0),
(5, '2024-04-03 16:00:00', '清明节', 'national', 2024, 0),
(6, '2024-04-30 16:00:00', '劳动节', 'national', 2024, 0),
(7, '2024-06-09 16:00:00', '端午节', 'national', 2024, 0),
(8, '2024-09-14 16:00:00', '中秋节', 'national', 2024, 0),
(9, '2024-09-30 16:00:00', '国庆节', 'national', 2024, 0),
(10, '2024-10-01 16:00:00', '国庆节', 'national', 2024, 0),
(11, '2024-10-02 16:00:00', '国庆节', 'national', 2024, 0);
